tap "dwarvesf/tap"
tap "eth-p/software"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "koekeishiya/formulae"
tap "melonamin/formulae"
tap "mongodb/brew"
tap "osx-cross/arm"
tap "osx-cross/avr"
tap "qmk/qmk"
tap "xorpse/formulae"
# Graphical system information display for macOS
brew "archey"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Python code formatter
brew "black"
# Resource monitor. C++ version and continuation of bashtop and bpytop
brew "btop"
# Cross-platform make
brew "cmake"
# Dependency manager for Cocoa projects
brew "cocoapods"
# Modern replacement for 'ls'
brew "exa"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Lint your Python code for style and logical errors
brew "flake8"
# Fast and simple Node.js version manager
brew "fnm"
# Command-line fuzzy finder written in Go
brew "fzf"
# Distributed revision control system
brew "git"
# Replace file copies using hardlinks
brew "hardlink"
# Improved top (interactive process viewer)
brew "htop"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Development kit for the Java programming language
brew "openjdk"
# Parser generator for use with Java applications
brew "javacc"
# Simple terminal UI for git commands
brew "lazygit"
# Next-gen compiler infrastructure
brew "llvm"
# Mac App Store command-line interface
brew "mas"
# MongoDB Shell to connect, configure, query, and work with your MongoDB database
brew "mongosh"
# NCurses Disk Usage
brew "ncdu"
# Fast, highly customisable system info script
brew "neofetch"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# General-purpose scripting language
brew "php", restart_service: true
# Execute binaries from Python packages in isolated environments
brew "pipx"
# Interpreted, interactive, object-oriented programming language
brew "python@3.9"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Safe, concurrent, practical language
brew "rust"
# SMART hard drive monitoring
brew "smartmontools"
# Terminal-based client for Spotify
brew "spotify-tui"
# Terminal multiplexer
brew "tmux"
# Manage complex tmux sessions easily
brew "tmuxinator"
# UNIX shell (command interpreter)
brew "zsh"
# Bash scripts that integrate bat with various command-line tools
brew "eth-p/software/bat-extras"
# Simple hotkey-daemon for macOS.
brew "koekeishiya/formulae/skhd"
# High-performance, schema-free, document-oriented database
brew "mongodb/brew/mongodb-community"
# A tiling window manager for macOS based on binary space partitioning.
brew "xorpse/formulae/yabai", args: ["HEAD"]
# GPU-accelerated terminal emulator
cask "alacritty"
# Enable Windows-like alt-tab
cask "alt-tab"
# Automatic tiling window manager similar to xmonad
cask "amethyst"
cask "background-music"
# Open-source browser prompter
cask "browserosaurus"
# Voice and text chat software
cask "discord"
# Client for the Dropbox cloud storage service
cask "dropbox"
# Password and credentials mananger
cask "enpass"
# Git client focusing on productivity
cask "gitkraken"
# GPU-based terminal emulator
cask "kitty"
# Open-source Markdown editor
cask "macdown"
# Easy to use text extraction tool for macOS
cask "trex"
cask "vimmotion"
mas "Amphetamine", id: 937984704
mas "Anybuffer", id: 1330815414
mas "Aviary", id: 1522043420
mas "Enpass", id: 732710998
mas "Focus To-Do", id: 1258530160
mas "Helium", id: 1054607607
mas "Hidden Bar", id: 1452453066
mas "Keynote", id: 409183694
mas "Kindle", id: 405399194
mas "Liya", id: 455484422
mas "Lockdown", id: 1483255076
mas "Magnet", id: 441258766
mas "Microsoft Remote Desktop", id: 1295203466
mas "Notability", id: 360593530
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Pi-hole Remote", id: 1515445551
mas "Session", id: 1521432881
mas "Shareful", id: 1522267256
mas "Shazam", id: 897118787
mas "Spark", id: 1176895641
mas "Streaks", id: 1493327990
mas "Telegram", id: 747648890
mas "TestFlight", id: 899247664
mas "The Unarchiver", id: 425424353
mas "Things", id: 904280696
mas "Timery", id: 1425368544
mas "Toggl Track", id: 957734279
mas "Trello", id: 1278508951
mas "Xcode", id: 497799835
