## Taps
tap "dwarvesf/tap"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "koekeishiya/formulae"
tap "melonamin/formulae"
tap "qmk/qmk"

## Brews (Packages)
brew "archey"
brew "bat"
brew "btop"
brew "exa"
brew "fd"
brew "fzf"
brew "git"
brew "htop"
brew "httpie"
brew "lazygit"
brew "ncdu"
brew "neofetch"
brew "neovim"
brew "ripgrep"
brew "rust"
brew "spotify-tui"
brew "tmux"
brew "tmuxinator"
brew "zsh"
brew "koekeishiya/formulae/skhd"
brew "koekeishiya/formulae/yabai"

## Casks (Applications)
cask "alt-tab"
cask "browserosaurus"
cask "enpass"
cask "kitty"
cask "trex"
