tap "dwarvesf/tap"
tap "eth-p/software"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "iina/mpv-iina"
tap "koekeishiya/formulae"
tap "melonamin/formulae"
tap "osx-cross/arm"
tap "osx-cross/avr"
tap "qmk/qmk"
# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Python code formatter
brew "black"
# Resource monitor. C++ version and continuation of bashtop and bpytop
brew "btop"
# GNU internationalization (i18n) and localization (l10n) library
brew "gettext"
# Interpreted, interactive, object-oriented programming language
brew "python@3.9"
# Manage compile and link flags for libraries
brew "pkg-config"
# Cross-platform make
brew "cmake"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Modern replacement for 'ls'
brew "exa"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Lint your Python code for style and logical errors
brew "flake8"
# Fast and simple Node.js version manager
brew "fnm"
# Generic library support script
brew "libtool"
# Generate pixel-perfect macOS folder icons in the native style
brew "folderify"
# Command-line fuzzy finder written in Go
brew "fzf"
# Distributed revision control system
brew "git"
# Render markdown on the CLI
brew "glow"
# Improved top (interactive process viewer)
brew "htop"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Simple terminal UI for git commands
brew "lazygit"
# Powerful, lightweight programming language
brew "lua"
# Mac App Store command-line interface
brew "mas"
# NCurses Disk Usage
brew "ncdu"
# Fast, highly customisable system info script
brew "neofetch"
# Small build system for use with gyp or CMake
brew "ninja"
# Development kit for the Java programming language
brew "openjdk@11"
# Execute binaries from Python packages in isolated environments
brew "pipx"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# SMART hard drive monitoring
brew "smartmontools"
# Terminal-based client for Spotify
brew "spotify-tui"
# Opinionated Lua code formatter
brew "stylua"
# Terminal multiplexer
brew "tmux"
# Manage complex tmux sessions easily
brew "tmuxinator"
# Internet file retriever
brew "wget"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# UNIX shell (command interpreter)
brew "zsh"
# Bash scripts that integrate bat with various command-line tools
brew "eth-p/software/bat-extras"
# Simple hotkey-daemon for macOS.
brew "koekeishiya/formulae/skhd"
# A tiling window manager for macOS based on binary space partitioning.
brew "koekeishiya/formulae/yabai"
# Menu bar tool to limit maximum charging percentage
cask "aldente"
# Application launcher and productivity software
cask "alfred"
# Enable Windows-like alt-tab
cask "alt-tab"
# Web browser focusing on privacy
cask "brave-browser"
# Open-source browser prompter
cask "browserosaurus"
# Voice and text chat software
cask "discord"
# Client for the Dropbox cloud storage service
cask "dropbox"
# Web browser
cask "firefox"
cask "font-hack-nerd-font"
# Desktop automation application
cask "hammerspoon"
# Keyboard customizer
cask "karabiner-elements"
# GPU-based terminal emulator
cask "kitty"
# Open-source Markdown editor
cask "macdown"
# Toolbox companion for QMK Firmware
cask "qmk-toolbox"
# Music streaming service
cask "spotify"
# Easy to use text extraction tool for macOS
cask "trex"
cask "vimmotion"
mas "Amphetamine", id: 937984704
mas "Anybuffer", id: 1330815414
mas "Enpass", id: 732710998
mas "Focus To-Do", id: 1258530160
mas "Hidden Bar", id: 1452453066
mas "Magnet", id: 441258766
mas "Microsoft Remote Desktop", id: 1295203466
mas "Pi-hole Remote", id: 1515445551
mas "Shareful", id: 1522267256
mas "Spark", id: 1176895641
mas "Streaks", id: 1493327990
mas "Telegram", id: 747648890
mas "TestFlight", id: 899247664
mas "The Unarchiver", id: 425424353
mas "Things", id: 904280696
mas "Toggl Track", id: 957734279
mas "Tomito", id: 1526042938
mas "Trello", id: 1278508951
mas "WhatsApp", id: 1147396723
mas "Xcode", id: 497799835
